Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
json[0]: Refreshing state... [id=sbeacon-backend-splitQuery:sbeacon-backend-splitQuery]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-admin]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-splitQuery]
module.svep[0].aws_api_gateway_deployment.VPApi: Refreshing state... [id=bel6ub]
module.svep[0].aws_api_gateway_stage.VPApi: Refreshing state... [id=ags-cgjp8s55wf-prod]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-v762unlmie-ybnaer-ANY]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-v762unlmie-ybnaer-ANY-200]
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Read complete after 0s [id=3202326539]
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Read complete after 0s [id=2351733893]
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Read complete after 0s [id=3202326539]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Read complete after 0s [id=3202326539]
module.sbeacon.aws_sns_topic_subscription.splitQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:307946671795:splitQuery:40158e2d-1b07-47ba-aa4e-3e569cd5b150]
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Read complete after 0s [id=3202326539]
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Read complete after 0s [id=3202326539]
module.sbeacon.aws_lambda_permission.SNSsplitQuery: Refreshing state... [id=SBeaconBackendAllowSNSsplitQueryInvoke]
module.sbeacon.aws_api_gateway_integration_response.map: Refreshing state... [id=agir-v762unlmie-lyhhyp-GET-200]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-dataPortal]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-3]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-3]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=cgjp8s55wf-prod-*/*]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E3KNV7RH93FYNK]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-v762unlmie-9axqx3-ANY]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-v762unlmie-4v9wtn-POST]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-v762unlmie-c6hkxf-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-v762unlmie-dl7fdc-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-v762unlmie-39tvlf-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-dl7fdc-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-v762unlmie-4v9wtn-GET]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-v762unlmie-c6hkxf-POST]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-v762unlmie-q7yacr-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-v762unlmie-w3i82v-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-v762unlmie-jx2hyi-GET]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-v762unlmie-fpksft-GET]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-v762unlmie-fpksft-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-v762unlmie-jx2hyi-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-v762unlmie-w3i82v-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-v762unlmie-q7yacr-GET]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-v762unlmie-9axqx3-ANY-200]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-v762unlmie-s5128d-GET]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-v762unlmie-oftg7w-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-v762unlmie-zf02l6-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-keddks-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-v762unlmie-s5128d-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-v762unlmie-keddks-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-ushf3y-POST]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-v762unlmie-oftg7w-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-v762unlmie-zf02l6-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-v762unlmie-ushf3y-GET]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-v762unlmie-4v9wtn-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-v762unlmie-dl7fdc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-v762unlmie-c6hkxf-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-v762unlmie-39tvlf-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-v762unlmie-4v9wtn-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-v762unlmie-c6hkxf-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-v762unlmie-q7yacr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-v762unlmie-w3i82v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-v762unlmie-jx2hyi-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-v762unlmie-jx2hyi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-v762unlmie-fpksft-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-v762unlmie-q7yacr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-v762unlmie-s5128d-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-dl7fdc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-keddks-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-v762unlmie-s5128d-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms: Refreshing state... [id=agmr-v762unlmie-w1wby7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-v762unlmie-keddks-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-v762unlmie-ushf3y-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-v762unlmie-fpksft-GET-200]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-v762unlmie-qtdi1n-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-abo0y5-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-e3975s-POST]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-v762unlmie-ayp129-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-v762unlmie-qtdi1n-GET]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-v762unlmie-ayp129-POST]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-v762unlmie-ybyrl8-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-v762unlmie-e3975s-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-v762unlmie-ybyrl8-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-v762unlmie-abo0y5-GET]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-v762unlmie-oftg7w-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-v762unlmie-zf02l6-GET-200]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-v762unlmie-qtucp9-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-v762unlmie-f2n5b0-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-v762unlmie-mtxjxl-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-f2n5b0-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-v762unlmie-792vzj-GET]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-v762unlmie-9xvb5z-GET]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-v762unlmie-qtucp9-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-792vzj-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-v762unlmie-1lyw8p-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-w1wby7-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-v762unlmie-w1wby7-GET]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-v762unlmie-mtxjxl-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-v762unlmie-1lyw8p-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-v762unlmie-9xvb5z-POST]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-v762unlmie-djl68tnr6f-OPTIONS-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-ushf3y-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-v762unlmie-oftg7w-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-v762unlmie-qtdi1n-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-abo0y5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-e3975s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-v762unlmie-ayp129-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-v762unlmie-w3i82v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-v762unlmie-ayp129-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-v762unlmie-ybyrl8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-v762unlmie-ybyrl8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-v762unlmie-abo0y5-GET-200]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-v762unlmie-85ixzl-POST]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-v762unlmie-9si70o-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-v762unlmie-t0ywlh-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-v762unlmie-e3nia7-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-v762unlmie-t0ywlh-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-csbk6t-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-5l41w9-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-v762unlmie-85ixzl-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-v762unlmie-5l41w9-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-v762unlmie-csbk6t-GET]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-v762unlmie-9si70o-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-v762unlmie-e3nia7-POST]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-v762unlmie-qtucp9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-v762unlmie-f2n5b0-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-v762unlmie-mtxjxl-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-f2n5b0-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-v762unlmie-792vzj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-v762unlmie-9xvb5z-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-792vzj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-v762unlmie-e3975s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-v762unlmie-mtxjxl-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-v762unlmie-1lyw8p-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-v762unlmie-1lyw8p-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-w1wby7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-v762unlmie-w1wby7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-v762unlmie-85ixzl-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-v762unlmie-9xvb5z-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-v762unlmie-t0ywlh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-csbk6t-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-v762unlmie-t0ywlh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-v762unlmie-85ixzl-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-v762unlmie-csbk6t-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-v762unlmie-5l41w9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-v762unlmie-9si70o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-v762unlmie-e3nia7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-v762unlmie-qtucp9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-5l41w9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-v762unlmie-9si70o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-v762unlmie-e3nia7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-v762unlmie-qtdi1n-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-v762unlmie-zf02l6-POST-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=53rclu]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-v762unlmie-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=v762unlmie-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E36BECILCZSHX1]
module.webgui.data.external.build: Reading...
module.gaspifs.null_resource.gaspifs-upload: Refreshing state... [id=930727657499123278]
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=25220f86-1793-478b-ac6e-11025780f011]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E1MIJT7J6L0XMY]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=3845166351]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=eec0112d-bdbc-6a87-67e2-c477628e1289]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250725041401948400000001]
module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms_post: Refreshing state... [id=agmr-v762unlmie-39tvlf-POST-200]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-39tvlf-POST]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-39tvlf-POST-200]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Read complete after 1m20s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=7954952022528324988]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=6432919131550411632]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:4b7154ca993a3d502f8a490c71de0b1b58d7a9bdc6a7a955be00daf56d6db7b1307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:4b7154ca993a3d502f8a490c71de0b1b58d7a9bdc6a7a955be00daf56d6db7b1" -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:4f458edc7ad5dd5e6d2b97de5f4c6ee61a83470372c135c2bfe9d1379a1ab58d307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:4f458edc7ad5dd5e6d2b97de5f4c6ee61a83470372c135c2bfe9d1379a1ab58d" -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:4ebc413756649f3257c335a567c3c942b6a7f2d3f869db3d36641cee7b4aefb5307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:4ebc413756649f3257c335a567c3c942b6a7f2d3f869db3d36641cee7b4aefb5" -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "gaspi_user_pool" {
        id                         = "ap-southeast-3_l5J5oX5o7"
        name                       = "gaspi-users"
        tags                       = {
            "Environment" = "dev"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
        # (18 unchanged attributes hidden)

      ~ email_configuration {
          ~ from_email_address     = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
          ~ source_arn             = "arn:aws:ses:ap-southeast-3:307946671795:identity/no.reply.gaspi.notifications@gmail.com" -> "arn:aws:ses:ap-southeast-3:307946671795:identity/dian.larasaty@xapiens.id"
            # (3 unchanged attributes hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.bounce must be replaced
-/+ resource "aws_ses_identity_notification_topic" "bounce" {
      ~ id                       = "no.reply.gaspi.notifications@gmail.com|Bounce" -> (known after apply)
      ~ identity                 = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.complaint must be replaced
-/+ resource "aws_ses_identity_notification_topic" "complaint" {
      ~ id                       = "no.reply.gaspi.notifications@gmail.com|Complaint" -> (known after apply)
      ~ identity                 = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.delivery must be replaced
-/+ resource "aws_ses_identity_notification_topic" "delivery" {
      ~ id                       = "no.reply.gaspi.notifications@gmail.com|Delivery" -> (known after apply)
      ~ identity                 = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_analyses"
        name               = "sbeacon_analyses"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250925_033239_00279_bpy65" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/analyses/" -> "s3://gaspi-metadata-20250725041403343200000002/analyses"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_biosamples"
        name               = "sbeacon_biosamples"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250925_033239_00143_iu23c" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/biosamples/" -> "s3://gaspi-metadata-20250725041403343200000002/biosamples"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (22 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_datasets"
        name               = "sbeacon_datasets"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250925_033238_00103_ujfyr" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_assemblyid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/datasets/" -> "s3://gaspi-metadata-20250725041403343200000002/datasets"
          - number_of_buckets         = 10 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_individuals"
        name               = "sbeacon_individuals"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250925_033239_00007_6ppjk" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/individuals/" -> "s3://gaspi-metadata-20250725041403343200000002/individuals"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-relations" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_relations"
        name               = "sbeacon_relations"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250925_033245_00023_e4ngh" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "individualid",
              - "biosampleid",
              - "runid",
              - "analysisid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/relations/" -> "s3://gaspi-metadata-20250725041403343200000002/relations"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250925_033239_00287_n5qw5" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/runs/" -> "s3://gaspi-metadata-20250725041403343200000002/runs"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:61" -> (known after apply)
      ~ code_sha256                 = "9YCv0XUOg837Z01ITfNhjjmt2sUyyhLjXf/YgeA2uyU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-17T05:17:00.023+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:61" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "QlvWZK8lUvFDmsa1GEE/WTkZ5pY/YZsg+8+wIJgjvPvlttk7Kd0wTcmYYnvMAZ45/L0a71UyDy5qflCnQKjGWA==" -> "RkT3IIDRspTrCh/tYv0LmtOJ03sIr3OcWww6zDx4PUBBRVjzHpFeez+fK0ghgTp1xCNhgsMgCYRfm7AGj7dnTQ==" # forces replacement
      ~ source_code_size            = 18107405 -> (known after apply)
      ~ version                     = "61" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal-20250725041402702700000001"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55" -> (known after apply)
      ~ code_sha256                 = "bQSTbkqTmnpavpQS3OL3SWIZ8QntO4G/1cIzNMxJ13Y=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-17T05:16:59.270+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Ru84te7hPeNx4OYtEbgj0UsR0HOVrL2gxmonp+EYsZ0Ig/YlNn+OEyM9rE6VFt0hFmB1bgxAmpe5f7LT0/qMeA==" -> "C/+Zm9ZA1VcCev1huOApYtzoL4cfp9Z6dnjPsLqQCekF4Ymd9Sa7dBMIS70jLrWrVwJm1Qc6i0Iuhwdbkp06og==" # forces replacement
      ~ source_code_size            = 17636130 -> (known after apply)
      ~ version                     = "55" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v1.1.0-46-gabfa66d9+" -> "v1.1.0-33-gac4918b6+"
        id                            = "webgui-bucket-20250725041401948400000001/version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "6432919131550411632" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "8d97fed1101823b467f4f631dbbbfebb2ed9c0b8" -> "193cea2280bdc3817f0742e1d068087c4f53b014"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "7954952022528324988" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "8d97fed1101823b467f4f631dbbbfebb2ed9c0b8" -> "193cea2280bdc3817f0742e1d068087c4f53b014"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "eec0112d-bdbc-6a87-67e2-c477628e1289" -> (known after apply)
      ~ triggers_replace = [
          ~ "v1.1.0-46-gabfa66d9+" -> "v1.1.0-33-gac4918b6+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4484494211263483285" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1738902407886527000" -> "1758772642459469000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5219275506318789036" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739950388698911000" -> "1758772641670403000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendClinicJobEmail"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"    = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7747474648663742241" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080896864511000" -> "1758772642259548000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendRegistrationEmail"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"    = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6535775966089025202" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748396982762038000" -> "1758772641544395000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "error-catcher-notifyOnError"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "error-catcher"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"      = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
              ~ "SES_TARGET_EMAIL"      = "devops@xapiens.id" -> "brendan.hosking@csiro.au"
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6910938088019647103" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753256441906966000" -> "1758772641949911200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "9c8a4b0df43bf65bf8ecafefe7886d9763819919"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:b9d2c37590fe3c48ceb5e5b452386255e2a1c51b3da3d7aaa0ed3cfc7db3a33b" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:b9d2c37590fe3c48ceb5e5b452386255e2a1c51b3da3d7aaa0ed3cfc7db3a33b" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "8184c611d1fe8f42abd2a1caa54e3866f430f773" -> "9c8a4b0df43bf65bf8ecafefe7886d9763819919"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/9ed7a3a53893853906a8cb3982a3442b5dae98a49d53a0c7a6e48775a617e148.zip" -> "builds/30267488a8a4325d2891ba324d9e8abb3c9c7a2b58300dc38534efe432500029.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-22T02:40:21.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/30267488a8a4325d2891ba324d9e8abb3c9c7a2b58300dc38534efe432500029.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/30267488a8a4325d2891ba324d9e8abb3c9c7a2b58300dc38534efe432500029.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7118804831643012909" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9ed7a3a53893853906a8cb3982a3442b5dae98a49d53a0c7a6e48775a617e148.zip" -> "builds/30267488a8a4325d2891ba324d9e8abb3c9c7a2b58300dc38534efe432500029.zip"
          ~ "timestamp" = "1758508635926626000" -> "1758772642039504000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a122d8c3b94b28867e80b1b41993e9f8360862b6c3d093aef7f2d3a6b55cdf50.zip" -> "builds/8401a682b1c05434cbe81f478429fb959be19d672c5882cbdc4b49802e1e9bda.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-09-22T02:45:50.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8401a682b1c05434cbe81f478429fb959be19d672c5882cbdc4b49802e1e9bda.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8401a682b1c05434cbe81f478429fb959be19d672c5882cbdc4b49802e1e9bda.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5336560905367264580" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a122d8c3b94b28867e80b1b41993e9f8360862b6c3d093aef7f2d3a6b55cdf50.zip" -> "builds/8401a682b1c05434cbe81f478429fb959be19d672c5882cbdc4b49802e1e9bda.zip"
          ~ "timestamp" = "1758508635347015000" -> "1758772642738376000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7726353861785968059" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080897719951000" -> "1758772642732099000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6651868988566220345" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1745822211927162000" -> "1758772642730786000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/02f60c6fd1b4111df98fc6415d0adf9ad374fc7f70043a7495bb4cae4e60073c.zip" -> "builds/ab36e06000e6badb6ecdf9c65c96e0a262966ac7d2af09530c1a1e9121f6657e.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-09-22T02:40:28.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 uncha
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.